[
  {
    "title": "Film to Digital Transfer Station",
    "category": "Film",
    "imageMain": "transfer1.jpg",
    "body": "Using a modified HVX200 camera (described below), I created a system for the digital capture of images from Super 8 and 16mm film. Software made for a Mac is the controller, receiving a video stream from the camera and operating a film projector (formerly part of an optical printer). It uses an Arduino microcontroller to manage the communication between the Mac application and the film projector. \n\nHere is a video demonstrating a [transfer](https://www.youtube.com/watch?v=vvz3zlWF6-g)",
    "dateOfCreation": "2015-12-02",
    "additionalText": "",
    "gitHubName": "filmTransferBox"
  },
  {
    "title": "Transistor Radio with guts replaced by iPod and Arduino",
    "category": "Music",
    "imageMain": "ipod1.jpg",
    "body": "I had always felt a desire to interact with the music player on my iPad in the same way I interact with a transistor radio. By making a custom iPad/iPhone app and using an Arduino microcontroller, I can control the music using a tuner dial. At start up, the iPad generates 11 stations of music using the music library on the device, and I surf the channels using the very same tuner dial that had come from a transistor radio. I even went so far as to package the entire apparatus inside the shell of a tabletop radio to make it fully convincing. \n\n Here is a video demonstrating the [device](https://youtu.be/E-PUny5bAkM)",
    "dateOfCreation": "2016-01-05",
    "additionalText": "",
    "gitHubName": "radioController"
  },
  {
    "title": "iPad App for Rental Equipment Checkout",
    "category": "Productivity",
    "imageMain": "gear2.jpg",
    "body": "A custom iPad app for managing equipment inventory and checkout procedures. The iPad uses a shared server as a data source so that many iPads can be in use among multiple staff members at any one time. Equipment is labeled with QR codes for easy scanning to look up or checkout pieces of gear.\n\nHere is a video demonstrating the app in [action](https://youtu.be/Kq9kMHEM_Vs)",
    "dateOfCreation": "2016-01-07",
    "additionalText": "",
    "gitHubName": ""
  },
  {
    "title": "Reverb: Video Installation",
    "category": "Film",
    "imageMain": "reverb1.jpg",
    "body": "A video installation I co-created with artist Donnabelle Casis as part of New Works Lab, an initiative by Seattle's 911 Media Arts Center. Light from opposing video projectors intermingle as they cast images of a woman sleeping and bees swarming onto the semi-transparent surface of screens made from sequins. A rhythmic sound, reminiscent of cicada, rises an falls in sync with the swarming of bees. Light dances around the entire space, which we designed to be inviting and comforting. Audiences were at ease to sit or lie down on a foam covered floor and allow the images and sounds to creep into their unconscious.\n\nHere is documentation of the [installation](https://youtu.be/N0AGp1xub8U)",
    "dateOfCreation": "2015-11-08",
    "additionalText": "",
    "gitHubName": ""
  },
  {
    "title": "Lens Hacking Workshop",
    "category": "Film",
    "imageMain": "lens1.jpg",
    "body": "Since Fall of 2012, I have been creating lenses using recycled glass elements from binoculars and other (very affordable) sources of lenses. With a little study in the design of lenses, I found I could achieve either a sharp image, comparable to any commercial lens, or (more interestingly) an image that dislays some degree of distortion or softness. I have been teaching this DIY method of lense creation in workshops ever since.  \n\n One of my short films shot entirely with [DIY lenses](https://youtu.be/pmLJrnN8aEU)",
    "dateOfCreation": "2015-11-12",
    "additionalText": "",
    "gitHubName": ""
  }
]
